Revit 2027 API
DoubleClickOptions.IsSupportedAction Method
 Checks whether the specified double-click target supports the specified action.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSupportedAction(
	DoubleClickTarget target,
	DoubleClickAction action
)
Public Function IsSupportedAction (
	target As DoubleClickTarget,
	action As DoubleClickAction
) As Boolean
public:
bool IsSupportedAction(
	DoubleClickTarget target,
	DoubleClickAction action
)
member IsSupportedAction :
        target : DoubleClickTarget *
        action : DoubleClickAction -> bool
Parameters
target DoubleClickTarget
 The double-click target to check.
action DoubleClickAction
 The desired double-click action.
Return Value
Boolean
 True if the target supports the specified action, false otherwise.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
DoubleClickOptions Class
Autodesk.Revit.UI Namespace